fix: include updated README and requirements missed in previous commit
